import 'package:weblog/gen/assets.gen.dart';
import 'package:weblog/models/data_models.dart';

Map homePgaePosterMap = {
  "imageAssets": Assets.images.kermanshah.provider(),
  "writer": "رسول امیری",
  "date": "سه روز قبل",
  "title": "گام‌های موثر در برنامه‌نویسی که شما را ",
  "view": "300"
};

// blog fake data
List<HashtagModels> tagList = [
  HashtagModels(title: "جاوا"),
  HashtagModels(title: "فلاتر"),
  HashtagModels(title: "کاتلین"),
  HashtagModels(title: "پایتون"),
  HashtagModels(title: "هوش مصنوعی"),
  HashtagModels(title: "پی‌اج‌پی"),
  HashtagModels(title: "بوت‌استرپ"),
  HashtagModels(title: "سی‌شارپ"),
];

List<BlogModel> blogList = [
  BlogModel(
    id: 1, 
    imageUrl: Assets.images.kermanshah.path,
    title: "آشنایی با کرمانشاه دیار خوبان غرب کشور", 
    writer: "رسول امیری", 
    writerImgUrl: Assets.images.avatar.path, 
    date: "۱ ساعت پیش", 
    content: """ 
    استان کرمانشاه یکی از پرجاذبه‌ترین مناطق ایران محسوب می‌شود؛ زیرا نزدیک به ۴۰۰۰ جاذبه ددر این استان وجود دارد. شهر کرمانشاه مرکز این استان و همچنین پرجمعیت‌ترین و بزرگترین شهر کردنشین ایران است.
اگر سلیقه‌ سفری متنوع را دارید، سفر به کرمانشاه برایتان لذت‌بخش و متنوع خواهد بود، زیرا می‌توانید با دیدن آثار باستانی و تاریخی در دالان تاریخ ایران چرخی بزنید و سپس با لمس طبیعت این منطقه، پهنه‌های بکر و بیکران کشور را ببینید. 
     """, 
    views: "۳۳۳"),

    BlogModel(
      id: 2, 
      imageUrl: Assets.images.hamadan.path, 
      title: "آسنایی با همدان دیار ابن‌سینا",
      writer: "دیوید بکهام", 
      writerImgUrl: Assets.images.avatar2.path, 
      date: "۵ ساعت پیش", 
      content: """ 
      در نقاط مختلف ایران جاذبه‌های گردشگری بی‌شماری وجود دارند. برخی از شهرها و مناطق، به‌دلیل عمق تاریخی و تمدن کهن، شهرتی جهانی دارند. در این راستا، شهر همدان در رده باستانی‌ترین شهرهای جهان، از اهمیتی ویژه برخوردار است.
این شهر از نخستین مناطق شکل‌گیری فرهنگ و تمدن، در ایران و جهان محسوب می‌شود.در کنار بعد تاریخی پر اهمیت همدان، موقعیت برجسته طبیعی این شهر نیز، همدان را بیش از پیش، متمایز می‌کند.
اگر از علاقه‌مندان سفر و گردشگری داخلی هستید و هنوز به همدان سفر نکرده‌اید، در اولین فرصت به دیدن این شهر بروید. تماشای زیبایی‌ها و برجستگی‌های تاریخی این شهر در یک سفر میسر نیست و می‌توان بارها به این خطه باستانی سفر کرد.
      """, 
      views: "۱۱۱"),     
      
      BlogModel(
      id: 3, 
      imageUrl: Assets.images.khansar.path, 
      title: "آشنایی با خوانسار زیبا",
      writer: "رسول امیری", 
      writerImgUrl: Assets.images.avatar.path, 
      date: "۱ روز قبل", 
      content: """ 
      اوایل بهار بهترین فصل سفر به خوانسار است، شهری که با لاله‌های واژگون و عسلش شناخته می‌شود و می‌گویند کوچه باغ‌هایش در ایران زبانزد است. به همین دلیل و به خاطر تماشای آن لاله‌ها و طبیعت بهاری است که هرساله سیل گردشگر در اردیبهشت راهی خوانسار می‌شود. از این رو تصمیم گرفتیم در این پست راهنمای گردشگری و سفر به خوانسار را برایتان بنویسیم که بدانید در سفر به این شهر باید کجاها را ببینید؟ کجا غذا بخورید؟ و روزتان را چه طور بگذرانید؟
خوانسار در ۱۵۰ کیلومتری شمال غربی اصفهان واقع شده و با اینکه زیاد از کویر دور نیست ولی یکی از خوش آب و هواترین‌هاست.
به طوری که در گرم‌ترین وقت سال دمای هوا به ۳۱ درجه می‌رسد و این یعنی اینکه در تابستان هم می‌تواند یکی از گزینه‌های سفر باشد. خوانسار جاهای زیادی برای رفتن دارد ولی در سفر به آن باید این جاها را حتما دید
      """, 
      views: "۳۳۳"),    
      
      BlogModel(
      id: 4, 
      imageUrl: Assets.images.yazd.path, 
      title: "آشنایی با یزد با معماری سنتی",
      writer: "احمد دوخی", 
      writerImgUrl: Assets.images.avatar4.path, 
      date: "۲ روز قبل", 
      content: """ 
      یزد شهر مشهور ایران زمین است و در اقصا نقاط جهان شناخته شده است. از تمام کشورهای دور و نزدیک جهان، گردشگران و جهان‌گردان به پهنۀ وسیع ایران زیبا می‌شتابند و شهر تاریخی و باستانی یزد را به عنوان مقصد سفر خود انتخاب می‌کنند.
اتفاقاً همین امر باعث شد که میزبون به شهر یزد از زاویه‌ای تازه نگاه کند و این بار در سفر به یزد از اطلاعاتی بنویسد که دانستن آن‌ها ارزش سفر به یزد را صدچندان افزایش می‌دهد.
به عقیدۀ میزبون جالب است اگر بدانید شهر یزد و استان یزد چند سال قدمت دارند. یا مثلاً اینکه از این شهر مهم، تاریخی و باستانی چه سوغاتی می‌توان به یادگار بُرد؛ یا حتی اینکه غذاهای سنتی این خطه چه‌ها هستند، جاهای دیدنی معروف یزد کجاست، در دوران تاریخی پیش از عصر ما یزد، این شهر جذاب و پرطرفدار، چه سرگذشتی را پشت سر گذاشته است؛ و حالا، در عصر و دورۀ ما این شهر جذاب و تماشایی از چه ویژگی‌های نابی برخوردار است، و چه عواملی سبب شده است که تمام مردم جهان این شهر اصیل و پرجاذبه را بشناسند و شیفتۀ سفر به این شهر باشند! شما هم اگر با میزبون هم عقیده هستید، اگر مشتاق هستید بیشتر در مورد شهر اصیل و تماشایی یزد بخوانید در این مقاله با میزبون همراه باشید. چون میزبون قصد دارد از تمام این عوامل و ویژگی‌ها بنویسد.
      """, 
      views: "۳۲۱"),     
      
      BlogModel(
      id: 5, 
      imageUrl: Assets.images.mazandaran.path, 
      title: "آشنایی با مازندران سرسبز",
      writer: "جیمی فلوید هاسل‌بین", 
      writerImgUrl: Assets.images.avatar3.path, 
      date: "یک هفته قبل", 
      content: """ 
      این بار می‌خواهیم گشتی در مازندران بزنیم و از جاهای دیدنی مازندران بگوییم، و به این سوال مهم مازندران کجا بریم؟ جواب دهیم، هرکسی با سفر به مازندران و تماشای جاذبه‌های آن مملو از تحسین خواهد شد.
از سواحل زیبای دریای خزر گرفته تا جنگل‌های انبوه سرسبز، این استان مقصدی پر از تجربیات منحصربه‌فرد است. تجربیاتی که شما را از نگرانی‌ها و دغدغه‌های زندگی دور خواهد کرد و در کنار آرامش، حس ماجراجویی شما را برمی‌انگیزد. در این مطلب با من همراه باشید تا با یکدیگر به تماشای چشمه‌ها، جنگل‌ها، دشت‌ها و سواحل مسحورکننده مازندران بزنیم.
      """, 
      views: "۲۵۷"),   
      
      BlogModel(
      id: 6, 
      imageUrl: Assets.images.shiraz.path, 
      title: "آشنایی با مازندران سرسبز",
      writer: "حسین عبدالغنی سلیمانی", 
      writerImgUrl: Assets.images.avatar2.path, 
      date: "یک هفته قبل", 
      content: """ 
      شهر شیراز مرکز استان فارس، در جنوب‌غربی ایران و در دامنه کوه‌های زاگراس واقع شده است. این شهر پرآوازه با شهرهای مختلف استان فارس مانند کازرون، فیروز آباد، جهرم، فسا، استهبان، ارسنجان، مرودشت، سپندان و ممسنی همسایه است. طبیعت شیراز در تمامی فصول، جلوه باشکوهی را به نمایش می‌گذارد ، در بهار آب و هوای شیراز خنک و مطبوع است، در تابستان هوا رو به گرمی و خشکی می‌رود، در پاییز هوا به نسبت سرد شده و رنگ‌های گرم پاییزی، خیابان‌های این شهر را جلا می‌دهند و در زمستان سرد شیراز هم گاهی شاهد بارش برف خواهیم بود. البته با تمام این شگفتی‌ها، افراد، فصل بهار و به‌ویژه اردیبهشت ماه را برای سفر به شیراز انتخاب می‌کنند. زیرا این ماه، فصل رویش شکوفه‌های بهار‌نارنج است که فضای شهر را عطرآگین می‌کند.
بناهای ارزشمندی مثل تخت جمشید، نقش رستم، پاسارگاد، حافظیه، باغ‌های ایرانی، حرم شاهچراغ و … از مهم‌ترین جاهای دیدنی شیراز به شمار می‌روند. اما سفر به این شهر فقط شامل بازدید از جاذبه‌های تاریخی و طبیعی نمی‌شود، چون مکان‌های تفریحی شیراز تنوع و تعداد زیادی دارد. صنایع دستی زیبای شیراز هم از طبیعت زیبا و رنگارنگ این شهر و خلق‌و‌خوی مهربان مردمان آن نشأت گرفته است و آثاری چون قالی‌، گبه، ظروف خاتم‌کاری شده، ظروف نقره تا قلم‌زنی، معرق‌کاری، منبت و میناکاری را می‌توانید با خود به یادگار ببرید.
      """, 
      views: "۱۶۹"), 
 BlogModel(
      id: 7, 
      imageUrl: Assets.images.tehran.path, 
      title: "آشنایی با مازندران سرسبز",
      writer: "جیمی فلوید هاسل‌بین", 
      writerImgUrl: Assets.images.avatar.path, 
      date: "یک هفته قبل", 
      content: """ 
      
تهران با مساحت ۷۳۰ کیلومتر، بیست و پنجمین شهر پرجمعیت دنیا است. این شهر از شمال به رشته کوه‌ دماوند و از جنوب به کوه‌های ری و بی‌بی شهربانو و منطقه‌ کویری می‌رسد. به همین دلیل هوای شمال شهر از کوهستان تاثیر می‌گیرد و هوای جنوب تهران از دشت. میانگین دمای تهران در فروردین بین ۵/۴ تا ۱۵/۴ درجه سانتی‌گراد گزارش شده است.
تهران در گذشته از روستاهای ری بود. ری قدیم مرکز مهم سیاسی و بازرگانی به‌شمار می رفت. تهران در دوره‌ نادرشاه نام و نشانی یافت و در دوره‌ صفوی ناصری شد. این شهر در دوره‌ قاجار پایتخت ایران شد.
سابقه‌ زندگی در تهران به ۵ هزار سال پیش از میلاد برمی‌گردد. اکنون تهران بیست و هفتمین شهر بزرگ دنیا است که از دهه‌ ۱۳۴۰ تاکنون پذیرای مهاجران بسیاری از شهرهای گوناگون کشور بوده است. جمعیت تهران در حل حاضر از مرز ۱۳ میلیون نفر گذشته است. ساکنان قدیم تهران، قوم‌های فارسی زبان بوده‌اند و اکنون بیشتر مردم تهران به زبان فارسی با لهجه‌ تهرانی سخن می‌گویند.
نام تهران پس از هجوم اعراب کم‌کم به طهران تغییر پیدا کرد،‌ اما نیز‌ زمان با جنبش مشروطه و تغییر در نگارش فارسی، املای «طهران» منسوخ شد و دوباره «تهران» نوشتند.
      """, 
      views: "۳۱۰"), 

];

List<BlogPadcastModel> padcastList = [
 
   BlogPadcastModel(
  id: 1, 
  title: "بازاریابی محتوایی",
  description: """
لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
""",
  imgPadcast: Assets.images.contentMarketing.path,
  speaker: "رسول امیری", 
  imgSpeaker: Assets.images.avatar2.path, 
  view: "۴۳۲", 
  date: "۱ روز قبل"),

 BlogPadcastModel(
  id: 2, 
  title: "رادیو فلاتر", 
  description: """
لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
""",
  imgPadcast: Assets.images.flutter.path,
  speaker: "رسول امیری", 
  imgSpeaker: Assets.images.avatar.path, 
  view: "۵۵۵", 
  date: "۱ روز قبل"),

   BlogPadcastModel(
  id: 3, 
  title: "اصول کسب درآمد از برنامه‌نویسی ", 
  description: """
لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
""",
  imgPadcast: Assets.images.programmingMoney.path,
  speaker: "رسول امیری", 
  imgSpeaker: Assets.images.avatar3.path, 
  view: "۲۸۹", 
  date: "۱ روز قبل"),

   BlogPadcastModel(
  id: 4, 
  title: "nft چیست", 
  description: """
لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
""",
  imgPadcast: Assets.images.nft.path,
  speaker: "رسول امیری", 
  imgSpeaker: Assets.images.avatar.path, 
  view: "۴۲۱", 
  date: "۱ روز قبل"),

   BlogPadcastModel(
  id: 5, 
  title: "آشنایی با لینوکس", 
  description: """
لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
""",
  imgPadcast: Assets.images.linux.path,
  speaker: "رسول امیری", 
  imgSpeaker: Assets.images.avatar4.path, 
  view: "۶۷۶", 
  date: "۱ روز قبل"),

   BlogPadcastModel(
  id: 6, 
  title: "معرفی برترین لپ‌تاپ‌های بازی", 
  description: """
لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
""",
  imgPadcast: Assets.images.laptop.path,
  speaker: "رسول امیری", 
  imgSpeaker: Assets.images.avatar3.path, 
  view: "۴۵۱", 
  date: "۱ روز قبل"),
   
   
  
];